{
	"my-": "A prefix that indicates 'personal' resources.",
	"team-": "A prefix that indicates team-member resources.",
	"admin-": "A prefix that indicates brand administrator resources.",
	"public-": "A prefix that indicates publicly accessible resources.",

	"about": "Information about the current resource.",
	"accept": "A form for accepting an offer, such as a membership offer where acceptance is indicated by the 'joined' date.",
	"account": "A brand account. An account with a sign=-1 is a revenue budget that holds debits, with a normal balance of <= 0, to be used for receiving payments. An account with a sign=1 is an expense budget that holds credits, with a normal balance >=0, to be used as payment.",
	"accounts": "A collection of brand accounts, that is, a brand's ledger.",
	"add": "A form for adding a resource to a collection, or for adding to a resource's tracked quantity.",
	"alias": "An alternate name for a resource. For example, an accountholder may assign an alias to the holding instead of referring to it by the account name.",
	"amount": "A numeric value that quantifies an important aspect of a resource. For example, in the context of a promo or transaction record, the amount may be a product price or a suggested donation amount.",
	"approve": "A form for approving the completion of a pending resource action.",
	"area_code": "The phone area code where a brand is located. (optional, self-reported)",
	"authcode": "The permissions related to a resource. In the case of an account or an accountholding, the authcode encodes which transaction activities are allowed based on the intersection of account.authcode x holder.authcode. The presence of the following characters in the authcode signify the corresponding permission: 'c' to add budget, 'f' to act as a budget transfer originator, 't' to act as a buget transfer recipient, 'i' for internal budget use within a brand, 'x' for external budget use between brands.",

	"brand": "The currency issuer related to this resource.",
	"brand_id": "(deprecated)",
	"brand_name": "(deprecated) The name of the related brand. Use the (sub)resource 'name' instead.",
	"by_all_limit": "This is a weekly limit on the total inflow transaction amount for a given account or usage for a given product, regardless of the payor's brand or user id. This is similar to coupon restrictions, allowing your brand to set limits on transactions and also to combat spammy payment offers. ",
	"by_brand_limit": "A weekly limit on total inflow transaction amount for a given account or usage for a given promo, based on the payor's brand id. This is similar to coupon restrictions, allowing your brand to set limits on transactions and also to combat spammy payment offers. ",
	"by_user_limit": "A weekly limit on total inflow transaction amount for a given account or usage for a given promo, based on the payor's user id. This is similar to coupon restrictions, allowing your brand to set limits on transactions and also to combat spammy payment offers. ",
	"by_user_wait": "How long a user must wait after using a promo, before that user can reuse the same promo.",

	"code": "An alpha-numeric string that a payment recipient shares with a payor to authorize a payment or promo use.",
	"collectionOf": "The term used for the collection item. For example, instead of promos.items, you could use promos.promo or promos[promos.collectionOf].",
	"country_code": "The ISO3 code of a brand location.",
	"created": "The date and time when a resource was created, in the form of `YYYY-MM-DD hh:mm:ss`.",

	"direction": "(deprecated) The direction in a transaction record signifies whether the accountholder acted as a payment originator ('from') or recipient ('to').",

	"edit": "A form for updating a resource.",
	"ended": "The date of resource or relation deactivation, formatted as `YYYY-MM-DD hh:mm:ss`.",
	"expires": "The date after which a given resource will no longer be available. For example, a promo may expire after a week.",

	"hold": "A form for preventing the auto-approval or auto-rejection of a pending resource action.",
	"holder-edit": "(deprecated)",
	"holder": "An accountholder.",
	"holders": "A collection of accountholders.",
	"holding": "An accountholding.",
	"holdings": "A collection of accountholdings.",
	"hours": "The number of hours per week that a member spends towards contributing to the team goals.",

	"id": "A numeric identifier for a resource, that is unique for a given resource type.",
	"imageTemplate": "If given, a user interface provider may use this resource to display a brand icon or promo image.",
	"imageURL": "If given, a user interface provider may use this link to display a brand icon or promo image.",
	"infoURL": "External web page about a resource.",
	"inputs": "A set of information that goes into a resource or submission. Within a form, these are the properties for which values are to be provided in a submission.",
	"issuer": "When given as part of a resource, this links to an admin view of the related brand resource.",
	"issuers": "A collection of brand-resources to which a user has a member role of admin.",
	"itemsLimit": "The maximum number of items that is returned in a collection page. To request more than the itemsLimit, make subsequent requests using the collection's 'next' or 'prev' link.",
	
	"joined": "The date when a user joined a team.",

	"keyword": "In the context of a relay, this is the prefix to be used with a relay id, such as the 'food-' in the relay token value of 'food-645'. This keyword is assigned by the user when creating a promo, and also helps to counter (but not prevent) spammy transaction offers by making it harder to guess the full value of a relay token.",

	"limkey": "Short for 'limited key', this is a semi-secret string that an accountholder shares as part of a token to pre-authorize a payment. The token is usually in the format 'holder_id(hyphen)limkey'.",
	"login_provider": "The identity provider for the currently logged-in user, usually an OpenId provider.",

	"me": "Information and resources that relates to the currently logged-on user.",
	"member": "A user that is a member of a brand.",
	"members": "A collection of brand members.",
	"membership": "Team membership information for a user.",
	"memberships": "A collection of team membership information for a user.",

	"name": "The name of the resource.",
	"note": "A short text used to annotate a resource such as a transaction record.",
	"numMemberships": "The number of teams a user belongs to.",

	"other": "The other brand in a transaction record, from the viewpoint of an accountholder.",
	"other_acct": "The other account in a transaction record, from the viewpoint of an accountholder.",
	
	"pageOf": "The '@id' of the collection to which the current collection page belongs. In other words, this is the link to the default collection resource without pagination.",
	"pageOrder": "Either 'asc' or 'desc' based on item id's.",
	"payURL": "A URL that, when clicked, is intended to automatically open the tatag.cc wallet of a payor.",
	"promo": "A brand promotion, used to advertise anything that could be the target of a payment.",
	"promos": "A collection of brand promotions.",
	"promoPage": "The tatag.cc-hosted web page about the promo. An infoURL, when available, should be preferred as an external link.",
	"promo_id": "(deprecated)",

	"rating": "A value assigned by a user to a team or brand, recorded as a score and reason.",
	"ratings": "A collection of 'rating'.",
	"reason": "A rationale related to a resource, such as as why a brand was given a certain score in a rating.",
	"record": "Tracked information about a resource, usually involving lifecycle events, such as a transaction record.",
	"record_id": "(deprecated)",
	"records": "A collection of 'record'.",
	"reject": "A form for rejecting the completion of a pending resource action.",
	"relay": "A token that is used to preauthorize the use of a recipient account.",
	"relays": "A collection of relay tokens.",
	"revoke": "A form for revoking a current relation between resources, such as user membership in a team.",
	"role": "A user's role within the given context, such as a team member role.",

	"sign": "Indicates whether an account is a revenue (-1) or expense (+1) budget.",
	"score": "A numeric value along a scale indicating low to high value. In the case a 'rating' resource, the score correlates to the reputation of a team or brand as a currency issuer.",
	"status": "An integer associated with the current state of a resource. For example, a transaction record may be pending automated approval (status=0), on hold for manual approval (status=5), approved (status=7), or rejected (status <0).",

	"tally": "Periodic aggregated budget activity information, by brand and type of activity.",
	"target": "The URL where a form is to be submitted. If not given in a form, the target defaults to a resource's '@id'. The target is automatically handled by the generic client.",
	"team": "When given as part of a resource, this links to a member view of the related brand resource.",
	"teams": "A collection of brand-resources to which a user belongs as a member.",
	"throttle": "A limit on how much an account may be used for transactions for a given period, specified as amount per brand, amount per user, and amount by all.",
	"throttle_id": "(deprecated)",
	"throttles": "A collection of 'throttle'.",
	"totalHours": "The number of hours per week that a user plans to spend contributing to his team(s) goals.",
	"transfer": "A form for transferring a resource between collections, or for transferring tracked quantities between resources.",
	"txntype": "The type of budget activity that a transaction record is classified as. There are four possible values: 'np' (budget add), 'nn' (revenue budget transfer), 'pp' (expense budget transfer), and 'pn' (budget use).",
	"type_id": "A brand's self-reported classification.",
	"type_system": "The classification system that is used to determine the brand type_id value.",

	"unadd": "A form for reversing a previous approved 'add' action.",
	"unit": "The accounting-unit of a budget, also the currency unit. The only possible value right now is XTE.",
	"unuse": "A form for reversing a previously approved 'use' action.",
	"updated": "The UNIX timestamp when a resource was last updated.",	
	"url": "A link to a web page or image, typically not considered as an API data and therefore not expected to be dereferenced as part of the payload but instead opened as an external link or used in HTML representations.",
	"use": "A form for using a resource or its tracked quantity.",	
	"user": "A person-resource.",
	"user_id": "(deprecated)",
	
	"#": "end"
}